Revit 2027 API
ViewCropRegionShapeManager Properties
The ViewCropRegionShapeManager type exposes the following members.
Properties
Name | Description
BottomAnnotationCropOffset |  The offset from the bottom of the view crop that determines the location of the annotation crop bottom boundary.
CanBeSplit |  Verifies that the crop of the associated view is permitted to have multiple regions.
CanHaveAnnotationCrop |  Verifies that the view is allowed to have an annotation crop.
CanHaveShape |  Verifies that the crop of the associated view is permitted to have a non-rectangular shape.
IsSplitHorizontally |  Whether or not the view's crop is split (and the split is horizontal).
IsSplitVertically |  Whether or not the view's crop is split (and the split is vertical).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LeftAnnotationCropOffset |  The offset from the left of the view crop that determines the location of the annotation crop left boundary.
NumberOfSplitRegions |  The number of split crop regions (1 if the crop is not currently split).
RightAnnotationCropOffset |  The offset from the right of the view crop that determines the location of the annotation crop right boundary.
ShapeSet |  Whether or not the view crop has a non-rectangular shape set.
Split |  Whether or not the view crop is split.
TopAnnotationCropOffset |  The offset from the top of the view crop that determines the location of the annotation crop top boundary.
Top
See Also
Reference
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace